import { IField } from "../types";

export const DESKTOP_WIDTH: number = 1024;

export const FIELDS: IField[] = [
  {
    topic: "tech",
    title: "Технологии",
    dateStart: 1980,
    dateEnd: 1986,
    facts: [
      {
        topic: "tech_1980",
        date: "1980",
        description:
          "Открытие технологии генетической инженерии, позволяющей редактировать геном, стало значимым событием в биологии и медицине",
      },
      {
        topic: "tech_1981",
        date: "1981",
        description:
          "IBM представила первый персональный компьютер IBM PC, который стал одним из первых успешных персональных компьютеров для широкого потребительского рынка",
      },
      {
        topic: "tech_1982",
        date: "1982",
        description:
          "Компания Siemens представила первый смартфон — Siemens Mobira Talkman, который обеспечивал возможность передачи данных и голосовых коммуникаций в одном устройстве",
      },
      {
        topic: "tech_1984",
        date: "1984",
        description:
          "Компания Apple выпустила первый персональный компьютер Macintosh, который стал одним из первых коммерчески успешных компьютеров с графическим интерфейсом пользователя",
      },
      {
        topic: "tech_1985",
        date: "1985",
        description: "Корпорация Microsoft выпустила операционную систему Windows 1.0",
      },
      {
        topic: "tech_1986",
        date: "1986",
        description:
          "Компания IBM представила первый коммерчески успешный ноутбук — IBM PC Convertible",
      },
    ],
  },
  {
    topic: "films",
    title: "Кино",
    dateStart: 1987,
    dateEnd: 1991,
    facts: [
      {
        topic: "films_1987",
        date: "1987",
        description:
          'Студия Pixar Animation Studios выпустила фильм "Лук Лук и Люди", который стал первым полнометражным анимационным фильмом',
      },
      {
        topic: "films_1988",
        date: "1988",
        description:
          'Студия Walt Disney Pictures выпустила анимационный фильм "Алиса в Стране чудес"',
      },
      {
        topic: "films_1989",
        date: "1989",
        description:
          'Состоялась премьера фильма "Назад в будущее 2", научно-фантастической классики, которая получила признание зрителей',
      },
      {
        topic: "films_1990",
        date: "1990",
        description:
          'Вышел фильм "Призрак" с Патриком Суэйзи и Деми Мур, который стал популярным романтическим триллером и заслужил множество положительных отзывов',
      },
      {
        topic: "films_1991",
        date: "1991",
        description:
          'Состоялась премьера психологического триллера "Молчание ягнят" режиссёра Джонатана Демми, который стал культовым',
      },
    ],
  },
  {
    topic: "literature",
    title: "Литература",
    dateStart: 1992,
    dateEnd: 1997,
    facts: [
      {
        topic: "literature_1992",
        date: "1992",
        description:
          'Опубликован роман "Ветры зимы" писателя Джорджа Р.Р. Мартина, который стал частью серии книг "Песнь льда и пламени" и позднее стал основой для телесериала "Игра престолов"',
      },
      {
        topic: "literature_1993",
        date: "1993",
        description:
          'Вышел роман "Красное и черное" американского писателя Стивена Кинга, который стал одним из его самых известных произведений',
      },
      {
        topic: "literature_1994",
        date: "1994",
        description:
          'Опубликован роман "Форрест Гамп" американского писателя Уинстона Грума, который стал основой для популярного одноимённого фильма',
      },
      {
        topic: "literature_1995",
        date: "1995",
        description:
          'Опубликован роман "Американский психопат" канадского писателя Брета Истона Эллиса, который стал одним из самых обсуждаемых и провокационных произведений того времени',
      },
      {
        topic: "literature_1996",
        date: "1996",
        description:
          'Вышел роман "Ангелы и демоны" американского писателя Дэна Брауна, который стал популярным благодаря интригующему сюжету и увлекательному стилю автора',
      },
      {
        topic: "literature_1997",
        date: "1997",
        description: 'Состоялся первый выпуск романа "Гарри Поттер и философский камень"',
      },
    ],
  },
  {
    topic: "music",
    title: "Музыка",
    dateStart: 1998,
    dateEnd: 2005,
    facts: [
      {
        topic: "music_1998",
        date: "1998",
        description:
          "Был основан музыкальный фестиваль Coachella Valley Music and Arts Festival в Калифорнии, который с течением времени стал одним из самых крупных музыкальных событий в мире",
      },
      {
        topic: "music_1999",
        date: "1999",
        description: 'Вышел альбом "Californication" американской рок-группы Red Hot Chili Peppers',
      },
      {
        topic: "music_2001",
        date: "2001",
        description:
          'Вышел дебютный студийный альбом американской рок-группы Linkin Park под названием "Hybrid Theory"',
      },
      {
        topic: "music_2002",
        date: "2002",
        description:
          'Вышел альбом "The Eminem Show" американского рэпера Эминема, который стал одним из самых продаваемых альбомов года',
      },
      {
        topic: "music_2004",
        date: "2004",
        description:
          'Вышел альбом "American Idiot" американской рок-группы Green Day, который стал одним из самых популярных и влиятельных рок-альбомов десятилетия',
      },
      {
        topic: "music_2005",
        date: "2005",
        description:
          'Состоялся релиз второго студийного альбома американского рэпера 50 Cent под названием "The Massacre", который получил множество наград',
      },
    ],
  },
  {
    topic: "sports",
    title: "Спорт",
    dateStart: 2006,
    dateEnd: 2014,
    facts: [
      {
        topic: "sports_2006",
        date: "2006",
        description:
          "Состоялись Зимние Олимпийские игры в Турине, Италия. Это были первые зимние игры, проведённые в Италии",
      },
      {
        topic: "sports_2008",
        date: "2008",
        description:
          "Прошли Летние Олимпийские игры в Пекине, Китай. Эти игры были знаковыми и получили широкое международное внимание",
      },
      {
        topic: "sports_2010",
        date: "2010",
        description:
          "Южная Африка принимала Чемпионат мира по футболу. Этот турнир стал первым Чемпионатом мира по футболу, проведённым на африканском континенте",
      },
      {
        topic: "sports_2012",
        date: "2012",
        description:
          "Лондон стал хозяином Летних Олимпийских игры, где российские волейболисты стали Олимпийскими чемпионами",
      },
      {
        topic: "sports_2014",
        date: "2014",
        description:
          "Прошли Зимние Олимпийские игры в Сочи, Россия. Эти игры были крупнейшим спортивным событием года",
      },
    ],
  },

  {
    topic: "science",
    title: "Наука",
    dateStart: 2015,
    dateEnd: 2022,
    facts: [
      {
        topic: "science_2015",
        date: "2015",
        description:
          "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
      },
      {
        topic: "science_2016",
        date: "2016",
        description:
          "Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11",
      },
      {
        topic: "science_2017",
        date: "2017",
        description:
          "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
      },
      {
        topic: "science_2018",
        date: "2018",
        description:
          "NASA успешно запустила марсоход InSight на поверхность Марса. Эта миссия призвана исследовать внутреннюю структуру Марса и понять его геологическую историю",
      },
      {
        topic: "science_2019",
        date: "2019",
        description:
          "Астрономы представили первое изображение черной дыры в центре галактики Мессье 87",
      },
      {
        topic: "science_2022",
        date: "2022",
        description:
          "Астрономы объявили об обнаружении нескольких новых экзопланет, находящихся в зоне обитаемости вокруг своих звёзд",
      },
    ],
  },
];
